# GetPhaseStatus Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..GetPhaseStatus Method
Element Class See Also
---
Gets the status of a given element in the input phase
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementOnPhaseStatus GetPhaseStatus(
	ElementId phaseId
)
```

Visual Basic
---
```text
Public Function GetPhaseStatus ( _
	phaseId As ElementId _
) As ElementOnPhaseStatus
```

Visual C++
---
```text
public:
ElementOnPhaseStatus GetPhaseStatus(
	ElementId^ phaseId
)
```

# ### Parameters
phaseId
    Type: Autodesk.Revit.DB..::..ElementId Id of the phase.
# ### Return Value
The status of the element in the phase.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The id does not represent a valid phase. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Element Class
Autodesk.Revit.DB Namespace